{
  "backend/main.mo": "Motoko canister implementing user profiles and admin‑gated CRUD APIs for products using access control.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for build planning.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme color tokens and global background/foreground rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with public storefront routes and protected admin routes under a shared layout.",
  "frontend/src/components/admin/AdminEmptyState.tsx": "Displays an empty-state screen prompting admins to create their first product with a CTA button.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing products with validation and price conversion logic.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, footer, and main content structure.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking authentication, profile setup, and admin role before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication state and retry logic.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and save their profile before proceeding.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, admin link logic, and mobile menu using role and authentication state.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, details, price, and links to the product details page.",
  "frontend/src/components/ProductImage.tsx": "Image component providing a placeholder fallback when the provided image fails or is missing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and persisted identity loading.",
  "frontend/src/hooks/useProductMutations.ts": "React Query mutations for creating, updating, and deleting products using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks to fetch products, user roles, and profiles, plus saving user profiles.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light/dark theme colors.",
  "frontend/src/lib/format.ts": "Utility function for formatting a bigint price in cents into a USD currency string.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminProductEditPage.tsx": "Admin page for editing or deleting a product, including form handling and mutation logic.",
  "frontend/src/pages/admin/AdminProductNewPage.tsx": "Admin page for creating a new product using a form and create mutation.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin dashboard listing all products with actions to add, edit, or delete items.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays a single product with image, details, loading and error states, and a contact button.",
  "frontend/src/pages/StorefrontPage.tsx": "Shows a hero section and a products grid with loading, error, and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, plugins, and container settings.",
  "project_state.json": "Defines the project’s state, existing features, pending feature requests, and required image assets for a product-listing website. Tracks schema versioning, project metadata, and functional requirements."
}